Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The length of array increases by the number of variables pushed.
pt_br: O comprimento de array aumenta de acordo com o número de variáveis adicionadas.

source: Has the same effect as:
pt_br: Tem o mesmo efeito de:

source: Returns the new number of elements in the array.
pt_br: Retorna o novo número de elementos do array.

source: Example 1. array_push() example
pt_br: Exemplo de array_push()

source: $stack = array ("orange", "banana"); array_push ($stack, "apple", "raspberry");
pt_br: $cesta = array ("laranja", "morango"); array_push ($cesta, "melancia", "batata");

source: This example would result in $stack having the following elements:
pt_br: Neste caso $stack teria os seguintes elementos:

source: Array ([0] = orange [1] = banana [2] = apple [3] = raspberry)
pt_br: Array ([0] = laranja [1] = morango [2] = melancia [3] = batata)

source: See also array_pop(), array_shift(), and array_unshift().
pt_br: Veja também: array_pop(), array_shift(), e array_unshift().

source: array_rand() is rather useful when you want to pick one or more random entries out of an array.
pt_br: array_rand() é bastante útil quando se quer conseguir aleatoriamente um ou mais elementos de um array.

source: It takes an input array and an optional argument num_req which specifies how many entries you want to pick - if not specified, it defaults to 1.
pt_br: Ela recebe o array input e outro argumento opcional num_req o qual especifica quantos elementos se quer conseguir - se não for especificado, o padrão é 1.

source: If you are picking only one entry, array_rand() returns the key for a random entry.
pt_br: Se estiver pegando apenas um elemento, array_rand() retorna a chave para este elemento aleatório.

source: Otherwise, it returns an array of keys for the random entries.
pt_br: De outra forma, ele retorna um array com as chaves desses elementos aleatórios.

source: This is done so that you can pick random keys as well as values out of the array.
pt_br: Assim é possível conseguir chaves e valores aleatórios a partir da mesma função.

source: Don' t forget to call srand() to seed the random number generator.
pt_br: Não esqueça de chamar a função srand() para disparar o gerador de números aleatórios.

source: Example 1. array_rand() example
pt_br: Exemplo de array_rand()

source: array_reduce() applies iteratively the function function to the elements of the array input, so as to reduce the array to a single value.
pt_br: array_reduce() aplica iterativamente a função definida em callback nos elementos de input, de forma a reduzi-lo a um único valor.

source: If the optional initial is available, it will be used at the beginning of the process, or as a final result in case the array is empty.
pt_br: Se o argumento opcional initial for passado, ele será utilizado no início do processo, ou como um resultado final se o array estiver vazio.

source: Example 1. array_reduce() example
pt_br: Exemplo de array_reduce()

source: function rsum( $v, $w) {$v += $w; return $v;} function rmul($v, $w) {$v *= $w; return $v;} $a = array(1, 2, 3, 4, 5); $x = array(); $b = array_reduce($a, "rsum"); $c = array_reduce($a, "rmul", 10); $d = array_reduce($x, "rsum", 1);
pt_br: function soma( $v, $w) {$v += $w; return $v;} function multiplicacao($v, $w) {$v *= $w; return $v;} $a = array(1, 2, 3, 4, 5); $x = array(); $b = array_reduce($a, "soma"); $c = array_reduce($a, "multiplicacao", 10); $d = array_reduce($x, "soma", 1);

source: This will result in $b containing 15, $c containing 1200 (= 1*2*3*4*5*10), and $d containing 1.
pt_br: Isso resultará em $b contendo 15, $c contendo 1200 (= 1*2*3*4*5*10), e $d contendo 1.

source: See also array_filter() and array_map().
pt_br: Veja também array_filter(), array_map().

source: array_reverse() takes input array and returns a new array with the order of the elements reversed, preserving the keys if preserve_keys is TRUE.
pt_br: array_reverse() recebe o argumento array e retorna um novo array com a ordem dos elementos invertida, preservando as chaves se o argumento preserve_keys for TRUE.

source: Example 1. array_reverse() example
pt_br: Exemplo de array_reverse()

source: $input = array ("php", 4.0, array ("green", "red")); $result = array_reverse ($input); $result_keyed = array_reverse ($input, TRUE);
pt_br: $input = array ("php", 4.0, array ("verde", "vermelho")); $result = array_reverse ($input); $result_keyed = array_reverse ($input, TRUE);

source: This makes both $result and $result_keyed have the same elements, but note the difference between the keys.
pt_br: O programa acima fará com que $result e $result_keyed tenham os mesmos elementos, mas note a diferença entre as chaves.

source: The printout of $result and $result_keyed will be:
pt_br: A saída de $result e $result_keyed será:

source: Array ([0] = Array ([0] = green [1] = red) [1] = 4 [2] = php) Array ([2] = Array ([0] = green [1] = red) [1] = 4 [0] = php)
pt_br: Array ([0] = Array ([0] = verde [1] = vermelho) [1] = 4 [2] = php) Array ([2] = Array ([0] = verde [1] = vermelho) [1] = 4 [0] = php)

source: The second parameter was added in PHP 4.0.3.
pt_br: O segundo argumento foi adicionado no PHP 4.0.3.

source: Searches haystack for needle and returns the key if it is found in the array, FALSE otherwise.
pt_br: Procura em haystack pelo valor needle e retorna sua chave se for encontrado no array, e FALSE em caso contrário.

source: Prior to PHP 4.2.0, array_search() returns NULL on failure instead of FALSE.
pt_br: A partir do PHP 4.2.0, array_search() retorna NULL em caso de falha ao invés de FALSE.

source: If the optional third parameter strict is set to TRUE then the array_search() will also check the types of the needle in the haystack.
pt_br: Se o terceiro parâmetro opcional strict for passado como TRUE então array_search() também fará uma checagem de tipos de needle em haystack.

source: See also array_keys() and in_array().
pt_br: Veja também array_keys() e in_array().

source: array_shift() shifts the first value of the array off and returns it, shortening the array by one element and moving everything down.
pt_br: array_shift() retira o primeiro elemento de array e o retorna, diminuindo array em um elemento e movendo todos os outros elementos para trás.

source: All numerical array keys will be modified to start counting from zero while literal keys won 't be touched.
pt_br: Todas as chaves numéricas alteradas para começar a contar a de 0 (zero), enquanto chaves string permanecerão inalteradas.

source: Example 1. array_shift() example
pt_br: Exemplo de array_shift()

source: $stack = array ("orange", "banana", "apple", "raspberry"); $fruit = array_shift ($stack);
pt_br: $cesta = array ("laranja", "banana", "melancia", "morango"); $fruta = array_shift ($cesta);

source: This would result in $stack having 3 elements left:
pt_br: O programa acima resultaria em $stack tendo 3 elementos:

source: Array ([0] = banana [1] = apple [2] = raspberry)
pt_br: Array ([0] = banana [1] = melancia [2] = morango)

source: See also array_unshift(), array_push(), and array_pop().
pt_br: Veja também array_unshift(), array_push() e array_pop().

source: array_slice() returns the sequence of elements from the array array as specified by the offset and length parameters.
pt_br: array_slice() retorna a sequência de elementos de array especificada pelos parâmetros offset e length.

source: If offset is positive, the sequence will start at that offset in the array.
pt_br: Se offset for positivo, a sequência começará do início de array.

source: If offset is negative, the sequence will start that far from the end of the array.
pt_br: Se offset for negativo, a sequência começará dessa distância do final de array.

source: If length is given and is positive, then the sequence will have that many elements in it.
pt_br: Se length for especificado e positivo, então a sequência terá essa quantidade de elementos.

source: If length is given and is negative then the sequence will stop that many elements from the end of the array.
pt_br: Se length for especificado e negativo então a sequência pará dessa quantidade elementos a partir do final do array.

source: If it is omitted, then the sequence will have everything from offset up until the end of the array.
pt_br: Se for omitido, então a sequência terá todos os elementos a partir de offset até o final de array.

source: Note that array_slice() will ignore array keys, and will calculate offsets and lengths based on the actual positions of elements within the array.
pt_br: Note que array_slice() ignorará chaves e irá calcular os inícios e comprimentos dos intervalos baseada na posição absoluta dos elementos no array.

source: Example 1. array_slice() examples
pt_br: Exemplos de array_slice()

source: $input = array ("a", "b", "c", "d", "e"); $output = array_slice ($input, 2); / / returns "c", "d", and "e "$output = array_slice ($input, 2, -1); / / returns "c", "d" $output = array_slice ($input, -2, 1); / / returns "d "$output = array_slice ($input, 0, 3); / / returns "a", "b", and "c"
pt_br: $input = array ("a", "b", "c", "d", "e"); $output = array_slice ($input, 2); / / retorna "c", "d", e "e "$output = array_slice ($input, 2, -1); / / retorna "c", "d" $output = array_slice ($input, -2, 1); / / retorna "d "$output = array_slice ($input, 0, 3); / / retorna "a", "b", e "c"

source: See also array_splice().
pt_br: Veja também array_splice().

source: It returns an array containing the extracted elements.
pt_br: array_splice() remove a sequência de elementos do array input especificados por offset e length, e os substitui com os elementos do array replacement, se for especificado.

source: If offset is positive then the start of removed portion is at that offset from the beginning of the input If offset is positive then the start of removed portion is at that offset from the beginning of the input array.
pt_br: Se offset for positivo então o começo da região a ser removida será nessa posição a partir do início do array input.

source: If offset is negative then it starts that far from the end of the input array.
pt_br: Se offset for negativo então o ínicio será dessa distância do final de input.

source: If length is omitted, removes everything from offset to the end of the array.
pt_br: Se length for omitido, todos os elementos a partir de offset até o final do array serão removidos.

source: If length is specified and is positive, then that many elements will be removed.
pt_br: Se length for especificado e positivo, então essa quantidade de elementos será removida.

source: If length is specified and is negative then the end of the removed portion will be that many elements from the end of the array.
pt_br: Se length for especificado e negativo então o final da região a ser removida será dessa quantidade de elementos a partir do final do array.

source: Tip: to remove everything from offset to the end of the array when replacement is also specified, use count( $input) for length.
pt_br: Dica: para remover todos elementos a partir de offset até o final do array quando replacement também é especificado, use count( $input) para o argumento length.

source: If replacement array is specified, then the removed elements are replaced with elements from this array.
pt_br: Se o array replacement Se o array replacement for especificado, então os elementos removidos serão substituidos pelo elementos desse array.

source: If offset and length are such that nothing is removed, then the elements from the replacement array are inserted in the place specified by the offset.
pt_br: Se offset e length são dados de forma que nada será removido, então os elementos de replacement serão inseridos no lugar especificado por offset.

source: Tip: if the replacement is just one element it is not necessary to put array() around it, unless the element is an array itself.
pt_br: Dica: se a substituição for de apenas um elemento então não será necessário colocar array() para ele, a não ser que elementos seja um array.

source: The following equivalences hold:
pt_br: As seguintes equivalências abaixo são válidas:

source: Returns the array consisting of removed elements.
pt_br: Retorna um array contendo os elementos removidos.

source: Example 1. array_splice() examples
pt_br: Exemplos de array_splice()

source: $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 2); / / $input is now array ("red", "green") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 1, -1); / / $input is now array ("red", "yellow") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 1, count($input), "orange"); / / $input is now array ("red", "orange") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, -1, 1, array("black", "maroon")); / / $input is now array ("red", "green", / / "blue", "black", "maroon")
pt_br: $input = array ("vermelho", "verde", "azul", "amarelo"); array_splice ($input, 2); / / $input será agora array ("vermelho", "verde") $input = array ("vermelho", "verde", "azul", "amarelo"); array_splice ($input, 1, -1); / / $input será agora array ("vermelho", "amarelo") $input = array ("vermelho", "verde", "azul", "amarelo"); array_splice ($input, 1, count($input), "laranja"); / / $input será agora array ("vermelho", "laranja") $input = array ("vermelho", "verde", "azul", "amarelo"); array_splice ($input, -1, 1, array("preto", "marrom")); / / $input será agora array ("vermelho", "verde", "azul", "preto", "marrom")

source: See also array_slice().
pt_br: Veja também array_slice().

source: array_sum() returns the sum of values in an array as an integer or float.
pt_br: array_sum() retorna a soma dos valores de um array como inteiro ou real.

source: Example 1. array_sum() examples
pt_br: Exemplos de array_sum()

source: $a = array( 2, 4, 6, 8); echo "sum(a) = ".array_sum($a) ."\n"; $b = array("a"= 1.2 ,"b"= 2.3 ,"c"= 3.4); echo "sum(b) = ".array_sum($b) ."\n";
pt_br: $a = array( 2, 4, 6, 8); echo "soma(a) = ".array_sum($a) ."\n"; $b = array("a "= 1.2, "b" = 2.3, "c "= 3.4); echo "soma(b) = ".array_sum($b) ."\n";

source: sum( a) = 20 sum(b) = 6.9
pt_br: soma( a) = 20 soma(b) = 6.9

source: PHP versions prior to 4.0.6 modified the passed array itself and converted strings to numbers (which most of the time converted them to zero, depending on their value).
pt_br: Até a versão 4.0.6 do PHP, o array em si é modificado e converte strings para valores numéricos (as quais na maioria das vezes é convertida para zero a depender dos seus valores).

source: array_unique() takes input array and returns a new array without duplicate values.
pt_br: array_unique() recebe o argumento array e retorna um novo array sem valores duplicados.

source: Note that keys are preserved. array_unique() sorts the values treated as string at first, then will keep the first key encountered for every value, and ignore all following keys.
pt_br: Note que as chaves são preservadas. array_unique() ordena inicialmente os valores como strings mantendo a primeira chave encontrada para cada valor, e ignorando as chaves encontradas posteriormente.

source: It does not mean that the key of the first related value from the unsorted array will be kept.
pt_br: Isso não significa que a chave do primeiro valor do array ainda desordenado será mantido.

source: The first element will be used.
pt_br: O primeiro será usado.

source: Example 1. array_unique() example
pt_br: Exemplo de array_unique()

source: $input = array ("a "= "green", "red", "b" = "green", "blue", "red"); $result = array_unique ($input); print_r($result);
pt_br: $input = array ("a "= "verde", "vermelho", "b" = "verde", "azul", "vermelho"); $result = array_unique ($input); print_r($result);

source: This will output:
pt_br: A saída seria:

source: Array ([b] = green [1] = blue [2] = red)
pt_br: Array ([b] = verde [1] = azul [2] = vermelho)

source: Example 2. array_unique() and types
pt_br: Exemplo 2. array_unique() e tipos

source: The printout of the program above will be (PHP 4.0.6):
pt_br: A saída do programa acima seria (PHP 4.0.6):

source: array_unshift() prepends passed elements to the front of the array.
pt_br: array_unshift() adiciona os elementos passados como argumentos no início de array.

source: Note that the list of elements is prepended as a whole, so that the prepended elements stay in the same order.
pt_br: Note que a lista de elementos é adicionada como um todo, de forma que eles ficam na mesma ordem.

source: Example 1. array_unshift() example
pt_br: Exemplo de array_unshift()

source: $queue = array ("orange", "banana"); array_unshift ($queue, "apple", "raspberry");
pt_br: $cesta = array ("laranja", "banana"); array_unshift ($cesta, "melancia", "morango");

source: This would result in $queue having the following elements:
pt_br: O programa acima resultaria em $queue contendo os seguintes elementos:

source: Array ([0] = apple [1] = raspberry [2] = orange [3] = banana)
pt_br: Array ([0] = melancia [1] = morango [2] = laranja [3] = banana)

source: See also array_shift(), array_push(), and array_pop().
pt_br: Veja também array_shift(), array_push() e array_pop().

source: array_values() returns all the values from the input array.
pt_br: array_values() retorna todos os valores do array input.

source: Example 1. array_values() example
pt_br: Exemplo de array_values()

source: $array = array ("size "= "XL", "color" = "gold"); print_r(array_values ($array));
pt_br: $array = array ("tamanho "= "G", "cor" = "dourado"); print_r(array_values ($array));

source: Array ([0] = XL [1] = gold)
pt_br: Array ([0] = G [1] = dourado)

source: Implementation of array_values() for PHP 3 users
pt_br: Implementação de array_values() para PHP 3 users

source: See also array_keys().
pt_br: Veja também array_keys().

source: (PHP 3 = 3.0.3, PHP 4)
pt_br: array_walk

source: Applies the user-defined function function to each element of the array array.
pt_br: Descrição

source: Typically, function takes on two parameters.
pt_br: Aplica uma função definida pelo usuário nomeada pelo argumento func em cada elemento de arr.

source: The array parameter 's value being the first, and the key / index second.
pt_br: Normalmente, func recebe dois argumentos: o primeiro é o valor do elemento e o segundo, sua chave.

source: If the optional userdata parameter is supplied, it will be passed as the third parameter to the callback function.
pt_br: Se userdata for especificado, ele será usado como terceiro argumento da função do usuário.

source: If function function requires more parameters than given to it, an error of level E_WARNING will be generated each time array_walk() calls function.
pt_br: Se func necessita de mais argumentos do que o que está sendo passado para ela, um erro do nível E_WARNING será gerado a cada vez que array_walk() executar func.

source: These warnings may be suppressed by prepending the PHP error operator @ to the array_walk() call, or by using error_reporting().
pt_br: Esses avisos podem ser suprimidos adicionando o operador @ à chamada da função array_walk(), ou usando error_reporting().

source: If function needs to be working with the actual values of the array, specify the first parameter of function as a reference.
pt_br: Se func precisar alterar realmente os valores do array, especifique que o primeiro parâmetro de func deve ser passado por referência.

source: Then, any changes made to those elements will be made in the original array itself.
pt_br: Então qualquer mudança feita nesses elementos serão feitas no próprio array também.

source: Passing the key and userdata to function was added in 4.0.0
pt_br: A passagem das chaves e do terceiro argumento para func foi adicionada no PHP 4.0.0.

source: array_walk() is not affected by the internal array pointer of array. array_walk() will walk through the entire array regardless of pointer position.
pt_br: array_walk() não é afetada pelo ponteiro interno do array arr. array_walk() irá percorrer todo o array independente da posição atual do ponteiro interno.

source: To reset the pointer, use reset().
pt_br: Para reiniciar o ponteiro, use reset().

source: In PHP 3, array_walk() resets the pointer.
pt_br: No PHP 3, array_walk() reinicia o ponteiro.

source: Add / delete elements, unset elements, etc.
pt_br: Por exemplo, adicionar / remover elementos, removerá o array no qual array_walk() está sendo aplicada.

source: If the array that array_walk() is applied to is changed, the behavior of this function is undefined, and unpredictable.
pt_br: Exemplo 1.

source: Example 1. array_walk() example
pt_br: Exemplo de array_walk()

source: ?php $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); function test_alter ($item1, $key, $prefix) {$item1 = "$prefix: $item1";} function test_print ($item2, $key) {echo "$key. $item2 br \n";} echo "Before ...:\n"; array_walk ($fruits, 'test_print'); array_walk ($fruits, 'test_alter', 'fruit'); echo "... and after:\n"; array_walk ($fruits, 'test_print');?
pt_br: ?php $frutas = array ("d "= "limao", "a" = "laranja", "b "= "banana", "c" = "melancia"); function test_alter ($item1, $key, $prefix) {$item1 = "$prefix: $item1";} function test_print ($item2, $key) {echo "$key. $item2 br \n";} echo "Antes ...:\n"; array_walk ($frutas, 'test_print'); array_walk ($frutas, 'test_alter', 'fruta'); echo "... e depois:\n"; array_walk ($frutas, 'test_print');?

source: Before...: d. lemon a. orange b. banana c. apple... and after: d. fruit: lemon a. fruit: orange b. fruit: banana c. fruit: apple
pt_br: Antes...: d. limao a. laranja b. banana c. melancia... e depois: d. fruit: limao a. fruit: laranja b. fruit: banana c. fruit: melancia

source: See also list(), foreach, each(), and call_user_func_array().
pt_br: Veja também array_map(), list(), foreach, each() e call_user_func_array().

source: This function sorts an array such that array indices maintain their correlation with the array elements they are associated with.
pt_br: Esta função ordena um array de forma que a correlação entre índices e valores é mantida.

source: This is used mainly when sorting associative arrays where the actual element order is significant.
pt_br: É usada principalmente para ordenar arrays associativos onde a ordem dos elementos é um fator importante.

source: Example 1. arsort() example
pt_br: Exemplo de arsort()

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); arsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
pt_br: $frutas = array ("d "= "limao", "a" = "laranja", "b "= "banana", "c" = "melancia"); arsort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "$chave = $valor\n";}

source: This example would display:
pt_br: A saída deste exemplo seria:

source: a = orange d = lemon b = banana c = apple
pt_br: c = melancia d = limao a = laranja b = banana

source: The fruits have been sorted in reverse alphabetical order, and the index associated with each element has been maintained.
pt_br: As frutas foram ordenadas na ordem alfabética inversa, e os índices associados a cada valor foram mantidos.

source: You may modify the behavior of the sort using the optional parameter sort_flags, for details see sort().
pt_br: Você pode modificar o comportamento da ordenação usando o parâmetro opcional sort_flags, para mais detalhes veja sort().

source: See also asort(), rsort(), ksort(), and sort().
pt_br: Veja também: asort(), rsort(), ksort() e sort().

source: ascii2ebcdic() is an Apache-specific function which is available only on EBCDIC based operating systems (OS / 390, BS2000).
pt_br: ascii2ebcdic() é uma função específica do Apache, somente disponível em sistemas operacionais baseados no EBCDIC (OS / 390, BS2000).
